In [1]:
import pandas as pd
import numpy as np

In [6]:
t_df = pd.read_csv("/Users/bianca/Documents/GitHub/DAT-10-14/class material/Unit1/data/titanic.csv")

In [7]:
t_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
t_df['Age'].mean()

29.69911764705882

In [10]:
t_df[['Fare','SibSp']].median()

Fare     14.4542
SibSp     0.0000
dtype: float64

In [11]:
t_df[['Fare','SibSp']][:100].median()

Fare     15.675
SibSp     0.000
dtype: float64

In [19]:
t_df.iloc[:3,-4:]

             Ticket     Fare Cabin Embarked
0         A/5 21171   7.2500   NaN        S
1          PC 17599  71.2833   C85        C
2  STON/O2. 3101282   7.9250   NaN        S

In [20]:
t_df.iloc[:250,:3].mean()

PassengerId    125.500
Survived         0.344
Pclass           2.416
dtype: float64

In [25]:
t_df[t_df['Sex'] == 'female'].shape

(314, 12)

In [26]:
t_df[t_df['Sex']== 'male'].shape

(577, 12)

In [27]:
t_df[t_df['Sex']=='female']['Survived'].mean()

0.7420382165605095

In [28]:
t_df[t_df['Sex']=='male']['Survived'].mean()

0.18890814558058924

In [29]:
t_df[t_df['Pclass']<3]['Survived'].mean()

0.5575